#pragma once

#include "baseincludes.hpp"

class ClientClass
{
private:
	BYTE _chPadding[8];
public:
	char* chName;
	RecvTable* Table;
	ClientClass* pNextClass;
	int iClassID;
};

class CHLClient
{
public:
	ClientClass* GetAllClasses( void )
	{
		typedef ClientClass* ( __thiscall* OriginalFn )( PVOID ); //Anything inside a VTable is a __thiscall unless it completly disregards the thisptr. You can also call them as __stdcalls, but you won't have access to the __thisptr.
		return getvfunc<OriginalFn>( this, 8 )( this ); //Return the pointer to the head CClientClass.
	}
};

void DumpWeapons();
void DumpSig2Offs();
bool FileExists(const std::string& name);

class CGlobals
{
public:
	float realtime;
	int framecount;
	float absoluteframetime;
	float curtime;
	float frametime;
	int maxclients;
	int tickcount;
	float interval_per_tick;
	float interpolation_amount;
};

#include <game/shared/usercmd.h>

class C_AnimationLayer
{
public:
	C_AnimationLayer();
	void Reset();

	void SetOrder(int order);

public:
	bool IsActive(void);

	int   m_nSequence;
	float m_flPrevCycle;
	float m_flWeight;
	int   m_nOrder;

	float m_flPlaybackRate;
	float m_flCycle;

	float GetFadeout(float flCurTime);

	void BlendWeight();

	float m_flLayerAnimtime;
	float m_flLayerFadeOuttime;

	float m_flBlendIn;
	float m_flBlendOut;

	bool m_bClientBlend;
};

class CViewSetup
{
public:
	/*
		#  Portable CViewSetup Class #

		Created by: buxthemightyfag (me, lead developer of liquid)

		Notices:

		This class is incomplete.

		only variables that the cheat might require, have been dumped, due to time / timing issues / lack of time.
	*/
	char pad_0x0000[0x10]; //0x0000
	__int32 m_iWindowX; //0x0010 
	__int32 m_iWindowUnscaledX; //0x0014 
	__int32 m_iWindowY; //0x0018 
	char pad_0x001C[0x4]; //0x001C
	__int32 m_iWindowUnscaledY; //0x0020 
	char pad_0x0024[0x14]; //0x0024
	float m_flFov; //0x0038 
	float m_flViewmodelFov; //0x003C 
	Vector m_vOrigin; //0x0040 
	Vector m_vAngles; //0x004C 
	float m_flZNear; //0x0058 
	char pad_0x005C[0x3E4]; //0x005C

}; //Size=0x0440

class CBaseEntity
{
public:
	bool IsPlayer()
	{
		return (this->GetClientClass()->iClassID == 246);
	}
	Vector& GetAbsOrigin( )
	{
		typedef Vector& ( __thiscall* OriginalFn )( PVOID );
		return getvfunc<OriginalFn>(this, 9)(this);
	}
	int GetMaxHealth()
	{
		typedef int(__thiscall *OriginalFn)(void*);
		return getvfunc<OriginalFn>(this, 107)(this);
	}
	Vector& GetOldOrigin()
	{
		typedef Vector& (__thiscall* OriginalFn)(PVOID);
		return getvfunc<OriginalFn>(this, 129)(this);
	}
	Vector& GetAbsAngles( )
	{
		typedef Vector& ( __thiscall* OriginalFn )( PVOID );
		return getvfunc<OriginalFn>(this, 10)(this);
	}
	int GetNumAnimOverlays() const
	{
		CUtlVector<C_AnimationLayer> &m_AnimOverlay = *(CUtlVector<C_AnimationLayer> *)(this + 2216);
		return m_AnimOverlay.Count();
		// return *(int *)(this + 2288); // dont ask - check for "%8.4f : %30s : %5.3f : %4.2f : %1d"
	}
	void SetSize(Vector &mins, Vector &maxs) const
	{
		static DWORD dwFunc = sigs::GetClientSignature("55 8B EC 83 EC 28 53 8B 5D 08 56 8B 75 0C 57 8B 03");
		typedef void(__thiscall * OriginalFn)(const CBaseEntity *, Vector &, Vector &);
		return ((OriginalFn)(dwFunc))((this + 456), mins, maxs); // dont question it - check for "maxs" or "mins"
	}
	matrix3x4 &GetRgflCoordinateFrame()
	{
		// NETVAR_OFF( n, DWORD, -0x4C, "DT_BaseEntity", "m_CollisionGroup" );
		// return *reinterpret_cast< matrix3x4 * >( n.getValue(this) );
		PVOID pRenderable = static_cast<PVOID>(this + 0x4);
		typedef matrix3x4 &(__thiscall * OriginalFn)(PVOID);
		return getvfunc<OriginalFn>(pRenderable, 34)(pRenderable);
	}
	void GetWorldSpaceCenter( Vector& vWorldSpaceCenter)
	{
		Vector vMin, vMax;
		this->GetRenderBounds( vMin, vMax );
		vWorldSpaceCenter = this->GetAbsOrigin();
		vWorldSpaceCenter.z += (vMin.z + vMax.z) / 2;
	}
	void SetAbsOrigin(Vector& ang) {
		typedef void(__thiscall * OriginalFn)(const CBaseEntity *, Vector &);
		// search for "origin" and "angles"
		static OriginalFn fn = (OriginalFn)sigs::FindSig("client.dll", "55 8B EC 56 57 8B F1 E8 ? ? ? ? 8B 7D 08 F3 0F 10 07 0F 2E 86 ? ? ? ? 9F F6 C4 44 7A 28 F3 0F 10 47 ? 0F 2E 86 ? ? ? ? 9F F6 C4 44 7A 16 F3 0F 10 47 ? 0F 2E 86 ? ? ? ? 9F F6 C4 44 0F 8B ? ? ? ? 53 6A 01 8B CE E8 ? ? ? ? 81 A6 ? ? ? ? ? ? ? ? 8D 86 ? ? ? ? D9 07 D9 9E ? ? ? ? D9 47 04 50 D9 9E ? ? ? ? D9 47 08 6A 03 57 D9 9E ? ? ? ? E8 ? ? ? ? 8B 8E ? ? ? ? 83 C4 0C 83 F9 FF 74 45 8B 1D ? ? ? ? 8B C1 25 ? ? ? ? C1 E9 0C 03 C0 39 4C C3 08 75 2D 8B 5C C3 04 85 DB 74 25 8B CB E8 ? ? ? ? 8D 86 ? ? ? ? 50 8D 83 ? ? ? ? 50 57 E8 ? ? ? ? 83 C4 0C 5B 5F");
		return fn(this, ang);
	}
	DWORD* GetModel( )
	{
		PVOID pRenderable = (PVOID)(this + 0x4);
		typedef DWORD* ( __thiscall* OriginalFn )( PVOID );
		return getvfunc<OriginalFn>( pRenderable, 9 )( pRenderable );
	}
	bool SetupBones( matrix3x4 *pBoneToWorldOut, int nMaxBones, int boneMask, float currentTime )
	{
		PVOID pRenderable = (PVOID)(this + 0x4);
		typedef bool ( __thiscall* OriginalFn )( PVOID, matrix3x4*, int, int, float );
		return getvfunc<OriginalFn>( pRenderable, 16 )( pRenderable, pBoneToWorldOut, nMaxBones, boneMask, currentTime );
	}
	ClientClass* GetClientClass( )
	{
		PVOID pNetworkable = (PVOID)(this + 0x8);
		typedef ClientClass* ( __thiscall* OriginalFn )( PVOID );
		return getvfunc<OriginalFn>( pNetworkable, 2 )( pNetworkable );
	}
	bool IsDormant( )
	{
		PVOID pNetworkable = (PVOID)(this + 0x8);
		typedef bool ( __thiscall* OriginalFn )( PVOID );
		return getvfunc<OriginalFn>( pNetworkable, 8 )( pNetworkable );
	}
	int GetIndex( )
	{
		PVOID pNetworkable = (PVOID)(this + 0x8);
		typedef int ( __thiscall* OriginalFn )( PVOID );
		return getvfunc<OriginalFn>( pNetworkable, 9 )( pNetworkable );
	}
	void GetRenderBounds(Vector& mins, Vector& maxs)
	{
		PVOID pRenderable = (PVOID)(this + 0x4);
		typedef void(__thiscall* OriginalFn)(PVOID, Vector&, Vector&);
		getvfunc<OriginalFn>(pRenderable, 20)(pRenderable, mins, maxs);
	}
};

//Game Dependant Signature
#ifdef HL2MP_DM_v1
#define __WRITEUSERCMD_SIG "55 8B EC 8B 45 10 83 EC 10 B9 ? ? ? ? 8B 40 04 53 8B 5D 08 40 56 57 8B 7D 0C 39 47 04 8B 43 0C 0F 84 ? ? ? ? 3B 43 08 7C 05 88 4B 10 EB 1A 8B 13 8B F0 83 E0 1F C1 FE 05 89 45 F8 8B C1 8B 4D F8 D3 E0 09 04 B2 FF 43 0C 8B 47 04 8B 4B 08 8B 73 0C 89 45 FC 8B C1 2B C6 83 F8 20 7D 0C 89 4B 0C C6 43 10 01 E9 ? ? ? ? 8D 46 20 8B CE 89 43 0C 8B D6 8B 03 83 E2 1F C1 F9 05 BF ? ? ? ? 8B 1C 88 89 55 F4 8D 04 88 8B CA D3 45 FC B9 ? ? ? ? 2B CA 89 45 F8 D3 EF 8B 4D F4 8B F7 83 E6 01 8B 04 B0 8B D0 33 55 FC 23 D7 8B 7D F8 33 D0 83 C8 FF D3 E0 89 14 B7 8B D3 33 55 FC 23 D0 33 D3 8B 5D 08 89 17 8B 7D 0C EB 26 3B 43 08 7C 05 88 4B 10 EB 1C 8B 13 8B F0 83 E0 1F C1 FE 05 89 45 F4 8B C1 8B 4D F4 D3 E0 F7 D0 21 04 B2 FF 43 0C 8B 45 10 8B 4B 0C 8B 40 08 40 39 47 08 0F 84 ? ? ? ? 3B 4B 08 7C 06 C6 43 10 01 EB 17 8B 13 8B F1 C1 FE 05 83 E1 1F B8 ? ? ? ? D3 E0 09 04 B2 FF 43 0C 8B 47 08 8B 4B 08 8B 73 0C 89 45 FC 8B C1 2B C6 83 F8 20 7D 0C 89 4B 0C C6 43 10 01 E9 ? ? ? ? 8D 46 20 8B CE 89 43 0C 8B D6 8B 03 83 E2 1F C1 F9 05 BF ? ? ? ? 8B 1C 88 89 55 F8 8D 04 88 8B CA D3 45 FC B9 ? ? ? ? 2B CA 89 45 F4 D3 EF 8B 4D F8 8B F7 83 E6 01 8B 04 B0 8B D0 33 55 FC 23 D7 8B 7D F4 33 D0 83 C8 FF D3 E0 89 14 B7 8B D3 33 55 FC 23 D0 33 D3 8B 5D 08 89 17 8B 7D 0C EB 24 3B 4B 08 7C 06 C6 43 10 01 EB 19 8B 13 8B F1 83 E1 1F C1 FE 05 B8 ? ? ? ? D3 E0 F7 D0 21 04 B2 FF 43 0C 8B 45 10 F3 0F 10 47 ? 8B 4B 0C 0F 2E 40 0C 9F F6 C4 44 7B 40 3B 4B 08 7C 14 C6 43 10 01 D9 47 0C 51 8B CB D9 1C 24 E8 ? ? ? ? EB 4B 8B 13 8B F1 83 E1 1F C1 FE 05 B8 ? ? ? ? D3 E0 51 09 04 B2 8B CB FF 43 0C D9 47 0C D9 1C 24 E8 ? ? ? ? EB 24 3B 4B 08 7C 06 C6 43 10 01 EB 19 8B 13 8B F1 83 E1 1F C1 FE 05 B8 ? ? ? ? D3 E0 F7 D0 21 04 B2 FF 43 0C 8B 45 10 F3 0F 10 47 ? 8B 4B 0C 0F 2E 40 10 9F F6 C4 44 7B 40 3B 4B 08 7C 14 C6 43 10 01 D9 47 10 51 8B CB D9 1C 24 E8 ? ? ? ? EB 4B 8B 13 8B F1 83 E1 1F C1 FE 05 B8 ? ? ? ? D3 E0 51 09 04 B2 8B CB FF 43 0C D9 47 10 D9 1C 24 E8 ? ? ? ? EB 24 3B 4B 08 7C 06 C6 43 10 01 EB 19 8B 13 8B F1 83 E1 1F C1 FE 05 B8 ? ? ? ? D3 E0 F7 D0 21 04 B2 FF 43 0C 8B 45 10 F3 0F 10 47 ? 8B 4B 0C 0F 2E 40 14 9F F6 C4 44 7B 40 3B 4B 08 7C 14 C6 43 10 01 D9 47 14 51 8B CB D9 1C 24 E8 ? ? ? ? EB 4B 8B 13 8B F1 83 E1 1F C1 FE 05 B8 ? ? ? ? D3 E0 51 09 04 B2 8B CB FF 43 0C D9 47 14 D9 1C 24 E8 ? ? ? ? EB 24 3B 4B 08 7C 06 C6 43 10 01 EB 19 8B 13 8B F1 83 E1 1F C1 FE 05 B8 ? ? ? ? D3 E0 F7 D0 21 04 B2 FF 43 0C 8B 45 10 F3 0F 10 47 ? 8B 4B 0C 0F 2E 40 18 9F F6 C4 44 7B 40 3B 4B 08 7C 14 C6 43 10 01 D9 47 18 51 8B CB D9 1C 24 E8 ? ? ? ? EB 4B 8B 13 8B F1 83 E1 1F C1 FE 05 B8 ? ? ? ? D3 E0 51 09 04 B2 8B CB FF 43 0C D9 47 18 D9 1C 24 E8 ? ? ? ? EB 24 3B 4B 08 7C 06 C6 43 10 01 EB 19 8B 13 8B F1 83 E1 1F C1 FE 05 B8 ? ? ? ? D3 E0 F7 D0 21 04 B2 FF 43 0C 8B 45 10 F3 0F 10 47 ? 8B 4B 0C 0F 2E 40 1C 9F F6 C4 44 7B 40 3B 4B 08 7C 14 C6 43 10 01 D9 47 1C 51 8B CB D9 1C 24 E8 ? ? ? ? EB 4B 8B 13 8B F1 83 E1 1F C1 FE 05 B8 ? ? ? ? D3 E0 51 09 04 B2 8B CB FF 43 0C D9 47 1C D9 1C 24 E8 ? ? ? ? EB 24 3B 4B 08 7C 06 C6 43 10 01 EB 19 8B 13 8B F1 83 E1 1F C1 FE 05 B8 ? ? ? ? D3 E0 F7 D0 21 04 B2 FF 43 0C 8B 45 10 F3 0F 10 47 ? 8B 4B 0C 0F 2E 40 20 9F F6 C4 44 7B 40 3B 4B 08 7C 14 C6 43 10 01 D9 47 20 51 8B CB D9 1C 24 E8 ? ? ? ? EB 4B 8B 13 8B F1 83 E1 1F C1 FE 05 B8 ? ? ? ? D3 E0 51 09 04 B2 8B CB FF 43 0C D9 47 20 D9 1C 24 E8 ? ? ? ? EB 24 3B 4B 08 7C 06 C6 43 10 01 EB 19 8B 13 8B F1 83 E1 1F C1 FE 05 B8 ? ? ? ? D3 E0 F7 D0 21 04 B2 FF 43 0C 8B 4D 10 8B 47 24 3B 41 24 8B 4B 0C 0F 84 ? ? ? ? 3B 4B 08 7C 06 C6 43 10 01 EB 17 8B 13 8B F1 C1 FE 05 83 E1 1F B8 ? ? ? ? D3 E0 09 04 B2 FF 43 0C 8B 4F 24 8B 73 0C 89 4D FC 8B 4B 08 8B C1 2B C6 83 F8 20 7D 09 89 4B 0C C6 43 10 01 EB 7F 8D 46 20 8B CE 89 43 0C 8B D6 8B 03 83 E2 1F C1 F9 05 8B 3C 88"
#else
#define __WRITEUSERCMD_SIG "55 8B EC 83 EC 08 53 8B 5D 0C 56 8B 75 10 57 8B 7D 08 8B 46 04 40 39 43 04 8B 47 0C 0F 84 ? ? ? ? 3B 47 08 7C 06 C6 47 10 01 EB 1E 8B 0F 8B D0 C1 FA 05 83 E0 1F 89 45 FC 8B F0 8B 04 91 0F AB F0 8B 75 10 89 04 91 FF 47 0C 8B 43 04"
#endif

#include "studiohdr.hpp"

/*class IVModelInfo
{
public:
	DWORD * GetModel(int index)
	{
		typedef DWORD*(__thiscall* GetModelFn)(void*, int);
		return getvfunc<GetModelFn>(this, 1)(this, index);
	}

	int	GetModelIndex(const char* name)
	{
		typedef int(__thiscall* GetModelIndexFn)(void*, const char*);
		return getvfunc< GetModelIndexFn >(this, 2)(this, name);
	}

	const char* GetModelName(const DWORD* model)
	{
		typedef const char* (__thiscall* GetModelNameFn)(void*, const DWORD*);
		return getvfunc< GetModelNameFn >(this, 3)(this, model);
	}

	studiohdr_t* GetStudiomodel(const DWORD *mod)
	{
		typedef studiohdr_t* (__thiscall* GetStudiomodelFn)(void*, const DWORD*);
		return getvfunc< GetStudiomodelFn >(this, 28)(this, mod);
	}
};*/

class CUnknown {};

class CVerifiedUserCmd
{
public:
	CUserCmd m_cmd;
	CRC32_t  m_crc;
};

#ifndef _HL2DM_MP_v1
class IInput
{
public:
	CUnknown* unk01; //0x0000 
	char pad_0x0004[0xA8]; //0x0004
	float m_flEyeanglesX; //0x00AC 
	float m_flEyeanglesY; //0x00B0 
	char pad_0x00B4[0x4]; //0x00B4
	float m_flLastForwardmove; //0x00B8 
	char pad_0x00BC[0x40]; //0x00BC
	CUserCmd* m_pCommands; //0x00FC 
	CVerifiedUserCmd* m_pVerifiedCommands; //0x0100 
	char pad_0x0104[0x14]; //0x0104
	ConVar* m_pCartCamFollow; //0x0118 
	char pad_0x011C[0x28]; //0x011C
	float m_flCartCamFollow; //0x0144 
	char pad_0x0148[0x158]; //0x0148
	ConVar* m_pItemInspectModelSpinRate; //0x02A0 
	char pad_0x02A4[0x2590]; //0x02A4

}; //Size=0x2834

class CInput : public IInput
{
public:
	CUserCmd* GetUserCmd(int seq)
	{
		typedef CUserCmd *(__thiscall * OriginalFn)(PVOID, int);
		return getvfunc<OriginalFn>(this, 8)(this, seq);
	}
	bool CAM_IsThirdPerson()
	{
		typedef bool(__thiscall * OriginalFn)(PVOID);
		return getvfunc<OriginalFn>(this, 31)(this);
	}
};

#else

class IInput
{
public:
	char pad_0x0000[0x4]; //0x0000
	unsigned char m_bMouseInit; //0x0004 
	unsigned char m_bMouseState; //0x0005 
	char pad_0x0006[0xA]; //0x0006
	float m_flAccumulatedMouseXMovement; //0x0010 
	float m_flAccumulatedMouseYMovement; //0x0014 
	char pad_0x0018[0x8C]; //0x0018
	float m_flPreviousAnglesX; //0x00A4 
	float m_flPreviousAnglesY; //0x00A8 
	char pad_0x00AC[0x18]; //0x00AC
	CUserCmd* m_pCmds; //0x00C4 
	CVerifiedUserCmd* m_pVfCmds; //0x00C8 
	char pad_0x00CC[0x7B4]; //0x00CC

}; //Size=0x0880
class CInput : public IInput{
public:
	CUserCmd* GetUserCmd(int seq)
	{
		typedef CUserCmd *(__thiscall * OriginalFn)(PVOID, int);
		return getvfunc<OriginalFn>(this, 8)(this, seq);
	}
	bool CAM_IsThirdPerson()
	{
		typedef bool(__thiscall * OriginalFn)(PVOID);
		return getvfunc<OriginalFn>(this, 31)(this);
	}
};
#endif

class EngineClient
{
public:
	void GetScreenSize( int& width, int& height )
	{
		typedef void ( __thiscall* OriginalFn )( PVOID, int& , int& );
		return getvfunc<OriginalFn>( this, 5 )( this, width, height );
	}
	int GetAppId()
	{
		typedef int(__thiscall* OriginalFn)(PVOID);
		return getvfunc<OriginalFn>(this, 104)(this);
	}
	void ClientCmdCurrentTick(const char* cmd)
	{
		typedef void(__thiscall* OriginalFn)(PVOID, const char*);
		return getvfunc<OriginalFn>(this, 102)(this, cmd);
	}
	bool GetPlayerInfo( int ent_num, player_info_t *pinfo )
	{
